aula34/5-customArtillery/config.yml
config:
  target: 'http://localhost:8080'
  plugins:
    metrics-by-endpoint: {}

phases:
  - duration: 100
    arrivalRate: 10
    rampTo: 200

scenarios:
  - name: 'Sessão Flow (registro + login)'
    flow:
      - log: 'Criamos as variáveis para o usuário teste'
      - get:
          url: '/gerar-usuario-teste'  
      - log: 'Capturando dados do usuário'
      - capture:
          - json: '$.nome'
            as: 'nome'
          - json: '$.sobrenome'
            as: 'sobrenome'
          - json: '$.email'
            as: 'email'
          - json: '$.senha'
            as: 'senha'
      - log: 'Cadastrando usuário'  
      - post:
          url: '/api/sessao/registrar'  
          json:
            nome: '{{nome}}'
            sobrenome: '{{sobrenome}}'
            email: '{{email}}'
            senha: '{{senha}}'
      - think: 2
      - log: 'Login'
      - post:
          url: '/api/sessao/login'  
          json:
            email: '{{email}}'
            senha: '{{senha}}'